[
  {
    "title": "Demon Slayer",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Demon_Slayer.jpg?raw=true",
    "description": "Tanjiro Kamado becomes a demon slayer after tragedy strikes his family, determined to protect his sister and end the demon threat. The series blends high-speed sword battles, heartfelt bonds, and striking animation."
  },
  {
    "title": "Attack On Titan",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Attack_on_Titan.jpg?raw=true",
    "description": "In a world besieged by giant humanoid creatures, three youths enlist in the military to reclaim freedom and uncover the truth behind the towering walls that protect humanity. Tense action meets deep moral questions."
  },
  {
    "title": "Dungeon Meshi",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Dungeon_Meshi.jpg?raw=true",
    "description": "A broke adventuring party dives back into a monster-filled dungeon and survives by cooking the creatures they defeat. Lighthearted food gags mix with inventive fantasy lore and camaraderie."
  },
  {
    "title": "Toriko",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Toriko.jpg?raw=true",
    "description": "In a world where gourmet ingredients mean everything, gourmet hunter Toriko searches for the rarest foods and the most delicious flavors. Wild battles, fantastic beasts, and over-the-top action make every meal an adventure."
  },
  {
    "title": "Yuyu Hakusho",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Yuyu_Hakusho.jpg?raw=true",
    "description": "After dying unexpectedly, delinquent Yusuke Urameshi gets a second chance at life—as a Spirit Detective investigating supernatural cases. The series blends fierce martial arts, emotional stories, and a colorful cast of friends and foes."
  },
  {
    "title": "Dragon Ball Super",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Dragon_Ball_Super.jpg?raw=true",
    "description": "Goku and his friends return for all-new adventures as the universe faces greater threats than ever before. Packed with intense battles, cosmic rivals, and epic transformations, the series continues the legendary Dragon Ball saga."
  },
  {
    "title": "Naruto",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/NARUTO.jpg?raw=true",
    "description": "Naruto Uzumaki is a mischievous ninja outcast with a dream: to become the leader of his village and earn everyone's respect. His journey is filled with powerful jutsu, deep bonds, and the struggles of growing up and finding one's place."
  },
  {
    "title": "Jujutsu Kaisen",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Jujutsu_Kaisen.jpg?raw=true",
    "description": "Yuji Itadori is drawn into the world of cursed spirits after swallowing a powerful talisman. As he joins a secret society of jujutsu sorcerers, he faces deadly battles and uncovers a mysterious world of supernatural threats."
  },
  {
    "title": "My Hero Academia",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/My_Hero_academia.jpg?raw=true",
    "description": "In a world where almost everyone has a unique superpower called a 'Quirk,' Izuku Midoriya dreams of becoming a hero despite being born powerless. His journey to join the top hero academy is filled with epic battles, inspiring growth, and unforgettable friendships."
  },
  {
    "title": "Violet Evergarden",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Vaiolet.jpg?raw=true",
    "description": "After the war, Violet Evergarden, a former child soldier, begins a new life as a letter writer, helping others express emotions she struggles to understand herself. The series offers stunning visuals, moving stories, and a heartfelt search for meaning and love."
  },
  {
    "title": "One Punch Man",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/One_Punch_Man.jpg?raw=true",
    "description": "Saitama is a hero so powerful he can defeat any enemy with a single punch—but finds his unbeatable strength leaves him bored and searching for a real challenge. The series blends outrageous action, sharp comedy, and a fresh take on superhero tropes."
  },
  {
    "title": "Frieren: Beyond Journey's End",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Frieren.jpg?raw=true",
    "description": "After the Demon King is defeated, the elf mage Frieren embarks on a journey to understand humanity and the true meaning of memories and bonds. This gentle fantasy explores the passage of time, loss, and what it means to live and connect with others."
  },
  {
    "title": "Chainsaw Man",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Chainsaw_Man.jpg?raw=true",
    "description": "Denji, a young man burdened by debt, merges with his pet devil and becomes Chainsaw Man. Thrown into a brutal world of devil hunters, he fights for survival and a shot at a normal life, facing wild battles, dark humor, and unpredictable twists."
  },
  {
    "title": "Mob Psycho 100",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/MobPsycho.jpg?raw=true",
    "description": "Shigeo 'Mob' Kageyama is an awkward middle schooler with immense psychic powers, trying to live a normal life. As his emotions build, so does his supernatural strength, leading to wild battles and a heartfelt journey of self-discovery."
  },
  {
    "title": "SPYxFAMILY",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/SpyFamily.jpg?raw=true",
    "description": "Super-spy Twilight must create a fake family for a secret mission—but his new wife is an assassin, and his adopted daughter is a telepath. Their unpredictable double lives mix thrilling espionage, comedy, and wholesome family moments."
  },
  {
    "title": "Jojo",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Jojo.jpg?raw=true",
    "description": "The Joestar family faces bizarre adventures across generations, each member battling supernatural foes with unique powers. Known for its flamboyant style, creative battles, and iconic poses, Jojo’s Bizarre Adventure is a legendary and ever-evolving saga."
  },
  {
    "title": "Bocchi the Rock",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/bocchi_The_Rock.jpg?raw=true",
    "description": "Socially anxious guitarist Hitori 'Bocchi' Gotou joins a struggling rock band, hoping music will help her break out of her shell. Full of relatable humor, friendship, and catchy performances, the series is a heartwarming take on chasing your dreams."
  },
  {
    "title": "Card Captor Sakura",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Card_Captor_Sakura.jpg?raw=true",
    "description": "When Sakura Kinomoto discovers magical cards and gains mystical powers, she must capture the cards to save the world. Blending adventure, magic, and sweet slice-of-life moments, this classic is a beloved journey of growth and wonder."
  },
  {
    "title": "Ninja Go",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Ninja_Go.jpg?raw=true",
    "description": "A team of young ninja heroes, each mastering elemental powers, battles villains to protect their world. Combining action, humor, and teamwork, Ninjago offers epic adventures and inspiring lessons about friendship and courage."
  },
  {
    "title": "Hunter_Hunter",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Hunter_Hunter.jpg?raw=true",
    "description": "Young Gon sets out on a journey to become a Hunter and find his missing father. Along the way, he faces deadly trials, forms powerful friendships, and uncovers a world filled with mysterious creatures and high-stakes battles."
  },
  {
    "title": "Tengoku Daimakyou",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Tengoku_Daimakyou.png?raw=true",
    "description": "In a post-apocalyptic Japan, two youths wander a ruined landscape searching for 'Heaven.' Mysterious institutions, strange creatures, and hidden secrets create a haunting and suspenseful tale of survival and discovery."
  },
  {
    "title": "Dandadan",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Dandadan.jpg?raw=true",
    "description": "When a high school boy obsessed with UFOs meets a girl who believes in ghosts, their worlds collide—and so do supernatural forces. Packed with frantic action, wild comedy, and strange encounters, Dandadan is an unpredictable thrill ride."
  },
  {
    "title": "Nichijou",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Nichijou.jpg?raw=true",
    "description": "Everyday life spirals into the absurd as three high school girls experience surreal adventures and random chaos. Blending sharp comedy, charming characters, and wild imagination, Nichijou is a beloved celebration of the ridiculous."
  },
  {
    "title": "Evangelion",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/Evangelion.jpg?raw=true",
    "description":"In a world threatened by mysterious beings called Angels, teenager Shinji Ikari is recruited to pilot a giant bio-mechanical robot. Evangelion is a groundbreaking series that blends intense action, psychological drama, and deep philosophical questions about humanity."
  },
  {
    "title": "One_Peace",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/One_Peace.jpg?raw=true",
    "description":"Monkey D. Luffy sets sail on a quest to find the legendary treasure known as One Piece and become the King of the Pirates. Alongside his colorful crew, Luffy faces powerful foes, uncovers ancient mysteries, and experiences epic adventures across a vast and imaginative world."
  },
  {
    "title": "Demon Slayer MugenTrain",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/MugenTrain.jpg?raw=true",
    "description":"Tanjiro and his companions board the Mugen Train to assist the Flame Hashira, Kyojuro Rengoku, in investigating mysterious disappearances. What begins as a routine mission turns into a fight for survival against powerful demons in this thrilling, emotionally charged movie."
  },
  {
    "title": "Death Note",
    "image_url": "https://github.com/DonaldSatoshi/assets/blob/main/Anime_Image/DeathNote.jpg?raw=true",
    "description": "High school genius Light Yagami discovers a mysterious notebook that lets him kill anyone whose name he writes in it. As Light sets out to rid the world of evil, a deadly cat-and-mouse game unfolds between him and the enigmatic detective L."
  }
]
